
////////////////////////////////////////////////////////////////////////////////
// Подсистема "СклоненияПредставленийОбъектов".
//
////////////////////////////////////////////////////////////////////////////////

// Функция склоняет ФИО
// Только для работы на ОС Windows.
//
// Параметры:
// 	ФИО		- Строка 			- Строка, в которой содержится ФИО для склонения
// 	Падеж 	- Число  			- падеж, в который необходимо просклонять представление объекта
//                  			1 - Именительный
//                  			2 - Родительный
//                  			3 - Дательный
//                  			4 - Винительный
//                  			5 - Творительный
//                  			6 - Предложный
// Объект 	- ОбъектСклонения 	- Ссылка на объект, реквизит которого склоняется
// Пол		- Число				- Число - пол физического лица, 
//								1 - мужской, 
//								2 - женский.
//
// Возвращаемое значение:
//  Строка - Результат склонения ФИО в падеже 
//
Функция ПросклонятьФИО(ФИО, Падеж, Объект = Неопределено, Пол = Неопределено) Экспорт
	
	Возврат СклонениеПредставленийОбъектов.ПросклонятьФИО(ФИО, Падеж, Объект, Пол);
	
КонецФункции

// Функция склоняет представление объекта
// Только для работы на ОС Windows.
//
// Параметры:
// 	Представление - Строка 		- Строка, в которой содержится ФИО для склонения
// 	Падеж 		- Число  		- падеж, в который необходимо просклонять представление объекта
//  	               			1 - Именительный
//                  			2 - Родительный
//                  			3 - Дательный
//                  			4 - Винительный
//                  			5 - Творительный
//                  			6 - Предложный
// Объект 	- ОбъектСклонения 	- Ссылка на объект, реквизит которого склоняется
//
// Возвращаемое значение:
//  Строка - Результат склонения представления объекта в падеже 
//
Функция ПросклонятьПредставление(Представление, Падеж, Объект = Неопределено) Экспорт
	
	Возврат СклонениеПредставленийОбъектов.ПросклонятьПредставление(Представление, Падеж, Объект);
	
КонецФункции

#Область СлужебныеПроцедурыИФункции

// Процедура склоняет переданную фразу по всем падежам
//
// Параметры:
//  Форма 			- Управляемая форма - форма объекта склонения
//  Представление   - Строка - Строка для склонения
//  ЭтоФИО       	- Булево - Признак склонения ФИО
//	Пол				- Число	- Пол физического лица (в случае склонения ФИО)
//							1 - мужской 
//							2 - женский
//
Процедура ПросклонятьПредставлениеПоВсемПадежам(Представление, Склонения, ЭтоФИО = Ложь, Пол = Неопределено) Экспорт
	
	СтруктураСклонений = СклонениеПредставленийОбъектов.ПросклонятьПредставлениеПоВсемПадежам(Представление, ЭтоФИО, Пол);		
	Склонения = Новый ФиксированнаяСтруктура(СтруктураСклонений);

КонецПроцедуры

#КонецОбласти